{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [784, 128], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_3/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [10], "dtype": "float32"}]}], "modelTopology": {"training_config": {"loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"config": {"decay": 0.0, "lr": 0.0010000000474974513, "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421}, "class_name": "Adam"}}, "model_config": {"config": [{"config": {"batch_input_shape": [null, 28, 28], "trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_2", "activation": "relu", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_3", "activation": "softmax", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 10}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}}